arduino/ArduinoCore-samd/boards.txt
# Generic D11C14A (SOIC-14)
d11c14a.name=Generic D11C14A
d11c14a.vid.0=0x16D0
d11c14a.pid.0=0x0557
d11c14a.vid.1=0x16D0
d11c14a.pid.1=0x0856
d11c14a.vid.2=0x16D0
d11c14a.pid.2=0x0B41
d11c14a.build.mcu=cortex-m0plus
d11c14a.build.f_cpu=48000000L
d11c14a.build.usb_product="D11C14A"
d11c14a.build.usb_manufacturer="MattairTech"
d11c14a.build.board=SAMD_ZERO
d11c14a.build.core=arduino
d11c14a.build.variant=Generic_D11C14A
d11c14a.build.variant_system_lib=
d11c14a.build.vid=0x16D0
d11c14a.upload.protocol=sam-ba
d11c14a.bootloader.tool=arduino:openocd
d11c14a.menu.clock.crystal_32k=32KHZ_CRYSTAL
d11c14a.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32KHZ_CRYSTAL
d11c14a.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
d11c14a.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
d11c14a.menu.clock.internal=INTERNAL
d11c14a.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
d11c14a.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED
d11c14a.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11c14a.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags}
d11c14a.build.ldscript=linker_scripts/gcc/flash_16KB.ld
d11c14a.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
d11c14a.bootloader.file=zero/binaries/sam_ba_Generic_D11C14A_SAMD11C14A.bin
d11c14a.menu.bootloader.4kb=4KB
d11c14a.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
d11c14a.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
d11c14a.menu.bootloader.4kb.upload.tool=MattairTech_Arduino:bossac
d11c14a.menu.bootloader.4kb.upload.use_1200bps_touch=true
d11c14a.menu.bootloader.4kb.upload.wait_for_upload_port=true
d11c14a.menu.bootloader.4kb.upload.native_usb=true
d11c14a.menu.bootloader.4kb.upload.maximum_size=12288
d11c14a.menu.bootloader.0kb=NO_BOOTLOADER
d11c14a.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d11c14a.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d11c14a.menu.bootloader.0kb.upload.tool=arduino:openocd
d11c14a.menu.bootloader.0kb.upload.use_1200bps_touch=false
d11c14a.menu.bootloader.0kb.upload.wait_for_upload_port=false
d11c14a.menu.bootloader.0kb.upload.native_usb=false
d11c14a.menu.bootloader.0kb.upload.maximum_size=16384
d11c14a.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
d11c14a.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.one_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
d11c14a.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
d11c14a.menu.serial.no_uart.build.serialcom_uart=NO_UART
d11c14a.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
d11c14a.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
d11c14a.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d11c14a.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.two_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.usb.cdc=CDC_ONLY
d11c14a.menu.usb.cdc.build.usbcom=CDC_ONLY
d11c14a.menu.usb.cdc.build.pid=0x0557
d11c14a.menu.usb.cdc_hid=CDC_HID
d11c14a.menu.usb.cdc_hid.build.usbcom=CDC_HID
d11c14a.menu.usb.cdc_hid.build.pid=0x0856
d11c14a.menu.usb.withcdc=WITH_CDC
d11c14a.menu.usb.withcdc.build.usbcom=WITH_CDC
d11c14a.menu.usb.withcdc.build.pid=0x0B41
d11c14a.menu.usb.hid=HID_ONLY
d11c14a.menu.usb.hid.build.usbcom=HID_ONLY
d11c14a.menu.usb.hid.build.pid=0x0B40
d11c14a.menu.usb.nocdc=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.pid=0x0A0C
d11c14a.menu.usb.none=USB_DISABLED
d11c14a.menu.usb.none.build.usbcom=USB_DISABLED
d11c14a.menu.usb.none.build.pid=0x0856


# MattairTech Core for Arduino/Genuino Zero (Autodetect Port)
arduino_zero.name=Arduino/Genuino Zero (Autodetect Port)
arduino_zero.bootloader.file=zero/binaries/sam_ba_arduino_zero_SAMD21G18A.bin
arduino_zero.vid.0=0x2341
arduino_zero.pid.0=0x804d
arduino_zero.vid.1=0x2341
arduino_zero.pid.1=0x004d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
arduino_zero.vid.2=0x2341
arduino_zero.pid.2=0x824d
arduino_zero.vid.2.build.vid=0x2341
arduino_zero.vid.2.build.pid=0x824d
arduino_zero.vid.2.build.usb_product="Genuino Zero"
arduino_zero.vid.2.bootloader.file=zero/binaries/sam_ba_genuino_zero_SAMD21G18A.bin
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
arduino_zero.vid.3=0x2341
arduino_zero.pid.3=0x024d
arduino_zero.vid.3.build.vid=0x2341
arduino_zero.vid.3.build.pid=0x824d
arduino_zero.vid.3.build.usb_product="Genuino Zero"
arduino_zero.vid.3.bootloader.file=zero/binaries/sam_ba_genuino_zero_SAMD21G18A.bin
# Programming port
arduino_zero.vid.4=0x03eb
arduino_zero.pid.4=0x2157
arduino_zero.vid.4.upload.tool=arduino:openocd
arduino_zero.vid.4.upload.use_1200bps_touch=false
arduino_zero.vid.4.upload.wait_for_upload_port=false
arduino_zero.vid.4.upload.native_usb=false
arduino_zero.upload.tool=MattairTech_Arduino:bossac
arduino_zero.upload.use_1200bps_touch=true
arduino_zero.upload.wait_for_upload_port=true
arduino_zero.upload.native_usb=true
arduino_zero.build.mcu=cortex-m0plus
arduino_zero.build.f_cpu=48000000L
arduino_zero.build.usb_product="Arduino Zero"
arduino_zero.build.usb_manufacturer="Arduino LLC"
arduino_zero.build.board=SAMD_ZERO
arduino_zero.build.core=arduino
arduino_zero.build.variant=arduino_zero
arduino_zero.build.variant_system_lib=
arduino_zero.build.vid=0x2341
arduino_zero.build.pid=0x804d
arduino_zero.upload.protocol=sam-ba
arduino_zero.menu.clock.crystal_32k=32KHZ_CRYSTAL
arduino_zero.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32KHZ_CRYSTAL
arduino_zero.menu.clock.internal=INTERNAL
arduino_zero.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
arduino_zero.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED
arduino_zero.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
arduino_zero.bootloader.tool=arduino:openocd
arduino_zero.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arduino_zero.build.ldscript=flash_256KB.ld
arduino_zero.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
arduino_zero.menu.bootloader.8kb=8KB
arduino_zero.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
arduino_zero.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
arduino_zero.menu.bootloader.8kb.upload.maximum_size=253952
arduino_zero.menu.bootloader.16kb=16KB
arduino_zero.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
arduino_zero.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
arduino_zero.menu.bootloader.16kb.upload.maximum_size=245760
arduino_zero.menu.bootloader.0kb=NO_BOOTLOADER
arduino_zero.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
arduino_zero.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
arduino_zero.menu.bootloader.0kb.upload.tool=arduino:openocd
arduino_zero.menu.bootloader.0kb.upload.use_1200bps_touch=false
arduino_zero.menu.bootloader.0kb.upload.wait_for_upload_port=false
arduino_zero.menu.bootloader.0kb.upload.native_usb=false
arduino_zero.menu.bootloader.0kb.upload.maximum_size=262144
arduino_zero.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
arduino_zero.menu.serial.one_uart.build.serialcom_uart=ONE_UART
arduino_zero.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
arduino_zero.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
arduino_zero.menu.serial.one_uart_two_wire_two_spi=ONE_UART_TWO_WIRE_TWO_SPI
arduino_zero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_uart=ONE_UART
arduino_zero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
arduino_zero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
arduino_zero.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
arduino_zero.menu.serial.two_uart.build.serialcom_uart=TWO_UART
arduino_zero.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
arduino_zero.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
arduino_zero.menu.serial.two_uart_two_wire_two_spi=TWO_UART_TWO_WIRE_TWO_SPI
arduino_zero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_uart=TWO_UART
arduino_zero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
arduino_zero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
arduino_zero.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
arduino_zero.menu.serial.no_uart.build.serialcom_uart=NO_UART
arduino_zero.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
arduino_zero.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
arduino_zero.menu.serial.no_uart_two_wire_two_spi=NO_UART_TWO_WIRE_TWO_SPI
arduino_zero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_uart=NO_UART
arduino_zero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
arduino_zero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
arduino_zero.menu.usb.cdc=CDC_ONLY
arduino_zero.menu.usb.cdc.build.usbcom=CDC_ONLY
arduino_zero.menu.usb.cdc_hid=CDC_HID
arduino_zero.menu.usb.cdc_hid.build.usbcom=CDC_HID
arduino_zero.menu.usb.withcdc=WITH_CDC
arduino_zero.menu.usb.withcdc.build.usbcom=WITH_CDC
arduino_zero.menu.usb.hid=HID_ONLY
arduino_zero.menu.usb.hid.build.usbcom=HID_ONLY
arduino_zero.menu.usb.nocdc=WITHOUT_CDC
arduino_zero.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
arduino_zero.menu.usb.none=USB_DISABLED
arduino_zero.menu.usb.none.build.usbcom=USB_DISABLED


# MattairTech Core for Arduino M0 / M0 Pro (Autodetect Port)
mzero.name=Arduino M0 / M0 Pro (Autodetect Port)
mzero.bootloader.file=zero/binaries/sam_ba_arduino_m0_pro_SAMD21G18A.bin
# M0 Pro (Programming port)
mzero.vid.0=0x03eb
mzero.pid.0=0x2111
mzero.vid.0.upload.tool=arduino:openocd
mzero.vid.0.upload.use_1200bps_touch=false
mzero.vid.0.upload.wait_for_upload_port=false
mzero.vid.0.upload.native_usb=false
# M0 Pro (Native Port)
mzero.vid.1=0x2a03
mzero.pid.1=0x004d
mzero.vid.2=0x2a03
mzero.pid.2=0x804d
mzero.vid.3=0x2a03
mzero.pid.3=0x004f
mzero.vid.4=0x2a03
mzero.pid.4=0x804f
mzero.build.vid=0x2a03
mzero.build.pid=0x804f
# M0
mzero.vid.5=0x2a03
mzero.pid.5=0x004e
mzero.vid.5.build.vid=0x2a03
mzero.vid.5.build.pid=0x804e
mzero.vid.5.bootloader.file=zero/binaries/sam_ba_arduino_m0_SAMD21G18A.bin
mzero.vid.6=0x2a03
mzero.pid.6=0x804e
mzero.vid.6.build.vid=0x2a03
mzero.vid.6.build.pid=0x804e
mzero.vid.6.bootloader.file=zero/binaries/sam_ba_arduino_m0_SAMD21G18A.bin
mzero.upload.tool=MattairTech_Arduino:bossac
mzero.upload.protocol=sam-ba
mzero.upload.use_1200bps_touch=true
mzero.upload.wait_for_upload_port=true
mzero.upload.native_usb=true
mzero.build.mcu=cortex-m0plus
mzero.build.f_cpu=48000000L
mzero.build.usb_product="Arduino M0 / M0 Pro"
mzero.build.board=SAM_ZERO
mzero.build.core=arduino
mzero.build.variant=arduino_m0_m0_pro
mzero.build.variant_system_lib=
mzero.menu.clock.crystal_32k=32KHZ_CRYSTAL
mzero.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32KHZ_CRYSTAL
mzero.menu.clock.internal=INTERNAL
mzero.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mzero.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED
mzero.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mzero.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
mzero.build.ldscript=flash_256KB.ld
mzero.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
mzero.bootloader.tool=arduino:openocd
mzero.menu.bootloader.16kb=16KB
mzero.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mzero.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mzero.menu.bootloader.16kb.upload.maximum_size=245760
mzero.menu.bootloader.16kb.upload.tool=arduino:avrdude
mzero.menu.bootloader.16kb.upload.protocol=stk500v2
mzero.menu.bootloader.16kb.upload.speed=57600
mzero.menu.bootloader.16kb.build.emu.mcu=atmega2560
mzero.menu.bootloader.8kb=8KB
mzero.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mzero.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mzero.menu.bootloader.8kb.upload.maximum_size=253952
mzero.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mzero.menu.bootloader.0kb=NO_BOOTLOADER
mzero.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mzero.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mzero.menu.bootloader.0kb.upload.tool=arduino:openocd
mzero.menu.bootloader.0kb.upload.use_1200bps_touch=false
mzero.menu.bootloader.0kb.upload.wait_for_upload_port=false
mzero.menu.bootloader.0kb.upload.native_usb=false
mzero.menu.bootloader.0kb.upload.maximum_size=262144
mzero.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mzero.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mzero.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mzero.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mzero.menu.serial.one_uart_two_wire_two_spi=ONE_UART_TWO_WIRE_TWO_SPI
mzero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_uart=ONE_UART
mzero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
mzero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
mzero.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mzero.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mzero.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mzero.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mzero.menu.serial.two_uart_two_wire_two_spi=TWO_UART_TWO_WIRE_TWO_SPI
mzero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_uart=TWO_UART
mzero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
mzero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
mzero.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mzero.menu.serial.no_uart.build.serialcom_uart=NO_UART
mzero.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mzero.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mzero.menu.serial.no_uart_two_wire_two_spi=NO_UART_TWO_WIRE_TWO_SPI
mzero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_uart=NO_UART
mzero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
mzero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
mzero.menu.usb.cdc=CDC_ONLY
mzero.menu.usb.cdc.build.usbcom=CDC_ONLY
mzero.menu.usb.cdc_hid=CDC_HID
mzero.menu.usb.cdc_hid.build.usbcom=CDC_HID
mzero.menu.usb.withcdc=WITH_CDC
mzero.menu.usb.withcdc.build.usbcom=WITH_CDC
mzero.menu.usb.hid=HID_ONLY
mzero.menu.usb.hid.build.usbcom=HID_ONLY
mzero.menu.usb.nocdc=WITHOUT_CDC
mzero.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mzero.menu.usb.none=USB_DISABLED
mzero.menu.usb.none.build.usbcom=USB_DISABLED
